-- 木头的数量监控
WOOD_ID = {
    { ID = 248012, VERSION = '地心' },
    { ID = 251773, VERSION = '巨龙' },
    { ID = 251772, VERSION = '暗影界' },
    { ID = 251768, VERSION = '争霸' },
    { ID = 251767, VERSION = '军团' },
    { ID = 251766, VERSION = '德拉诺' },
    { ID = 251763, VERSION = '熊猫人' },
    { ID = 251764, VERSION = '大灾变' },
    { ID = 251762, VERSION = '北极' },
    { ID = 242691, VERSION = '外域' },
    { ID = 245586, VERSION = '旧世' },
}

CURRENCY_ID = {
    { ID = 3290, R = 1,    G = 0.82, B = 0 },     -- 神话
    { ID = 3288, R = 0.5,  G = 0.5,  B = 1 },     -- 英雄
    { ID = 3286, R = 0.11, G = 0.53, B = 0.89 },  -- 勇士
    { ID = 3284, R = 0.48, G = 0.7,  B = 0.25 },  -- 老兵
    -- { ID = 2815, R = 1,    G = 1,    B = 1 },     -- 冒险家
}
