-- 木头的数量监控
WOOD_ID = {
    { ID = 256963, VERSION = '至暗' },
    { ID = 248012, VERSION = '地心' },
    { ID = 251773, VERSION = '巨龙' },
    { ID = 251772, VERSION = '暗影界' },
    { ID = 251768, VERSION = '争霸' },
    { ID = 251767, VERSION = '军团' },
    { ID = 251766, VERSION = '德拉诺' },
    { ID = 251763, VERSION = '熊猫人' },
    { ID = 251764, VERSION = '大灾变' },
    { ID = 251762, VERSION = '北极' },
    { ID = 242691, VERSION = '外域' },
    { ID = 245586, VERSION = '旧世' },
}

-- 货币
CURRENCY_ID = {
    -- { ID = 3290, R = 1,    G = 0.82, B = 0 },    -- 神话
    -- { ID = 3288, R = 0.5,  G = 0.5,  B = 1 },    -- 英雄
    -- { ID = 3286, R = 0.11, G = 0.53, B = 0.89 }, -- 勇士
    -- { ID = 3284, R = 0.48, G = 0.7,  B = 0.25 }, -- 老兵
    { ID = 3383, R = 1,    G = 1,    B = 1 },     -- 冒险家
    --
    -- { ID = 3290, R = 1,    G = 0.82, B = 0 },    -- 神话
    -- { ID = 3288, R = 0.5,  G = 0.5,  B = 1 },    -- 英雄
    -- { ID = 3286, R = 0.11, G = 0.53, B = 0.89 }, -- 勇士
    -- { ID = 3284, R = 0.48, G = 0.7,  B = 0.25 }, -- 老兵
    -- { ID = 2815, R = 1,    G = 1,    B = 1 },     -- 冒险家
}

-- 种族和天赋
-- 1力量 2敏捷 4智力
CLASS_SPEC = {
    -- =============== 布
    -- 术士
    WARLOCK = { [1] = 4, [2] = 4, [3] = 4, },
    -- 法师
    MAGE = { [1] = 4, [2] = 4, [3] = 4, },
    -- 牧师
    PRIEST = { [1] = 4, [2] = 4, [3] = 4 },

    -- =============== 皮
    -- 盗贼
    ROGUE = { [1] = 2, [2] = 2, [3] = 2, },
    -- 德鲁伊
    DRUID = { [1] = 4, [2] = 2, [3] = 2, [4] = 4, },
    -- DH
    DEMONHUNTER = { [1] = 2, [2] = 2, [3] = 2 },
    -- 武僧
    MONK = { [1] = 2, [2] = 4, [3] = 2 },

    -- =============== 锁
    -- 萨满
    SHAMAN = { [1] = 4, [2] = 2, [3] = 4 },
    -- 猎人
    HUNTER = { [1] = 2, [2] = 2, [3] = 2, },
    -- 唤魔师
    EVOKER = { [1] = 4, [2] = 4, [3] = 4, },

    -- =============== 板
    -- 战士
    WARRIOR = { [1] = 1, [2] = 1, [3] = 1, },
    -- DK
    DEATHKNIGHT = { [1] = 1, [2] = 1, [3] = 1, },
    -- 圣骑士
    PALADIN = { [1] = 4, [2] = 1, [3] = 1, },
}
